x1=[1,zeros(1,50)];%构建单位抽样序列
x2=[ones(1,51)];%构建阶跃序列
n=1:51;

a1=[1,0.75,0.125];%将系统一的各级响应系数进行排序，构成矩阵a1
b1=[1,-1];%将系统一的各级输入系数进行排序，构成矩阵b1
h1=filter(b1,a1,x1);%求系统一的单位抽样响应
g1=filter(b1,a1,x2);%求系统一的阶跃响应

a2=1;%将系统二的各级响应系数进行排序，构成矩阵a2
b2=[0,0.25,0.25,0.25,0.25];%将系统二的各级输入系数进行排序，构成矩阵b2
h2=filter(b2,a2,x1);%求系统二的单位抽样响应
g2_=conv(h2,x2);%使用卷积法求系统二的阶跃响应
g2=g2_(n);%对所求的阶跃相应进行截取

subplot(2,2,1),stem(h1),grid on,title('系统一单位抽样响应')%使用子窗口画出系统一单位抽样响应
subplot(2,2,2),stem(g1),grid on,title('系统一阶跃响应')%使用子窗口画出系统一阶跃响应
subplot(2,2,3),stem(h2),grid on,title('系统二单位抽样响应')%使用子窗口画出系统二单位抽样响应
subplot(2,2,4),stem(g2),grid on,title('系统二阶跃响应')%使用子窗口画出系统二阶跃响应
