x1=zeros(1,10);%调用zreos()函数生成一个一行十列的零矩阵
x1(1)=1;%将矩阵x1中序号为1的元素赋值为1
x2=ones(1,10);%调用ones() 函数生成一个一行十列的一矩阵
m=0:9;%使用冒号法定义一个从零开始，在九结束，步长为一的向量
x3=5*sin(2*pi*2*m/5+pi/2);%使用sin()函数定义正弦序列
x4=exp(1i*2*pi*m);%使用exp()函数定义复正弦序列 
x5=2.^m;%使用点幂运算指数序列 

subplot(3,3,1);%创建分窗，用子窗口显示输出图像
stem(x1);%将数据序列x1绘制为从沿x轴的基线延伸的针状图。各个数据值由终止每个针状图的圆指示。
grid on;%给坐标系添加网格
title("单位抽样序列");%将子窗口的标题命名为单位抽样序列
subplot(3,3,2);stem(x2);grid on;title("单位阶跃序列");
%以相同格式输出单位阶跃序列x2
subplot(3,3,3);stem(x3); grid on;title("正弦序列");
%以相同格式输出正弦序列x3
subplot(3,3,4);stem(x4); grid on;title("复正弦序列");
%以相同格式输出复正弦序列x4
subplot(3,3,5);stem(x5); grid on;title("指数序列");
%以相同格式输出指数序列x5


t1=-5:0.01:5;% 以0.01为步长定义向量t1，声明图像横坐标区间为-5到5
x6=5*cos(2*pi*t1)-3*cos(3*pi*t1)+2*cos(6*pi*t1)+cos(8*pi*t1);
%定义原信号x6
subplot(3,3,7); %创建分窗，用子窗口显示输出图像
plot(t1,x6);%绘制x6图像
grid on; %给坐标系添加网格
title("原信号");%将子窗口命名为"原信号"

fs1=12;%定义抽样频率取12Hz
ts=1/fs1;%定义对应的抽样周期
t2=-5:ts:5;%以抽样周期为步长创建新向量
x7=5*cos(2*pi*t2)-3*cos(3*pi*t2)+2*cos(6*pi*t2)+cos(8*pi*t2);
%对信号进行频率为12Hz的抽样 
subplot(3,3,8);stem(t2,x7),grid on%绘制抽样后的信号x7
title("12Hz抽样信号");%将子窗口命名为"12Hz抽样信号" 

fs2=20;% 定义抽样频率取20Hz 
ts2=1/fs2;%定义对应的抽样周期
t3=-5:ts2:5;%以抽样周期为步长创建新向量
x8=5*cos(2*pi*t3)-3*cos(3*pi*t3)+2*cos(6*pi*t3)+cos(8*pi*t3);
%对信号进频率为20Hz的抽样 
subplot(3,3,9);stem(t3,x8),grid on%绘制抽样后的信号x8
title("20Hz抽样信号");%将子窗口命名为"20Hz抽样信号" 
